nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/gsm/Device_gsm.c
/*
    App Gsm uart
*/

#include <rtthread.h>
#include <rthw.h>
#include "stm32f2xx.h"
#include "usart.h"
#include "board.h"
#include <serial.h>

#include  <stdlib.h>//数字转换成字符串
#include  <stdio.h>
#include  <string.h>
#include  <ctype.h>
#include  <stdlib.h>
#include  <stdarg.h>
#include "App_moduleConfig.h"
#include "App_gsm.h"
#include "SMS_PDU.h"
#include "SMS.h"

#define GSM_GPIO			GPIOC
#define GSM_TX_PIN			GPIO_Pin_10
#define GSM_TX_PIN_SOURCE	GPIO_PinSource10

#define GSM_RX_PIN			GPIO_Pin_11
#define GSM_RX_PIN_SOURCE	GPIO_PinSource11


u8 Module_Type = M69_GSM;


#ifdef  M50_GSM
//----------  EM310 自带协议栈相关  -----------------------------
//   1.  通过命令和状态 初始化命令
flash char  M50_SIM_Check_Str[] = "AT+QCCID\r\n"; //  检查SIM卡的存在
flash char  M50_IMSI_Check_str[] = "AT+CIMI\r\n";
flash char  M50_Signal_Intensity_str[] = "AT+CSQ\r\n"; // 信号强度 ，常用
flash char  M50_CommAT_Str1[] = "AT\r\n";
flash char  M50_CommAT_Str2[] = "ATE0\r\n";
flash char  M50_CommAT_Str3[] = "AT+QSPN?\r\n";
flash char  M50_CommAT_Str4[] = "AT+QAUDCH=2\r\n";         // 设置音频通道  主默认    2   免提
flash char  M50_CommAT_Str5[] = "AT+QMIC=0,10\r\n"; // 设置音频mic 输入通道 选择第一路
flash char  M50_CommAT_Str6[] = "AT+QIMUX=1\r\n";  //启用多链路模式
flash char  M50_CommAT_Str7[] = "AT+CLVL=80\r\n"; // 扬声器设置  --没有音频功放 没用
flash char  M50_CommAT_Str8[] = "AT+CRSL=80\r\n"; //;来电音量
flash char  M50_CommAT_Str9[] = "ATL2\r\n"; // 设置监听扬声器音量
flash char  M50_CommAT_Str11[] = "AT+QMEDVL=80\r\n"; //"AT%RECFDEL\r\n";//"AT\r\n"; //
flash char  M50_CommAT_Str12[] = "AT+CMGF=0\r\n"; // PDU 模式
flash char  M50_CommAT_Str13[] = "AT+CPMS=\"SM\",\"SM\",\"SM\"\r\n";
flash char  M50_CommAT_Str14[] = "AT+CNMI=2,1\r\n";


//    2.   通信模块登陆数据链路相关命令
flash char       M50_DialInit1[]                          = "AT+CGATT=1\r\n";
flash char	M50_DialInit2[]				=	"AT+CGACT=1,1\r\n";
flash char	M50_DialInit3[]				=	"AT+CGPADDR=1\r\n";
flash char	M50_DialInit4[] 			       =	"AT\r\n";  // 查看当前IP
char	M50_Dialinit_DNSR[50] 			=	"AT+QIDNSGIP=\"";     //  域名 up.gps960.com
char	M50_Dialinit_DNSR2[50] 			=	"AT+QIDNSGIP=\"";     //  域名


static u8   M50_Mainlink_send_over = 0; // 主链路已经发送信息
flash u8	M50_Send_TCP[20] = "AT+QISEND=1,%d\r\n";
flash u8	M50_Send_ISP[20] = "AT+QISEND=2,%d\r\n";

static u8	M50_DialStr_Link1_demo[90] = "AT+QIOPEN=%d,\"%s\",\"%d.%d.%d.%d\",\"%d\"\r\n"; //"ATD*99***1#\r\n"; AT%IPOPENX=1,"UDP","117.11.126.248",7106
static u8   M50_DialStr_LinkAux_demo[90] = "AT+QIOPEN=%d,\"%s\",\"%d.%d.%d.%d\",\"%d\"\r\n"; //"ATD*99***1#\r\n"; AT%IPOPENX=1,"UDP","117.11.126.248",7106
static u8   M50_DialStr_IC_card_demo[90] = "AT+QIOPEN=%d,\"%s\",\"%d.%d.%d.%d\",\"%d\"\r\n"; //"ATD*99***1#\r\n"; AT%IPOPENX=1,"UDP","117.11.126.248",7106

static u8	M50_DialStr_Link1[90];
static u8   M50_DialStr_LinkAux[90];
static u8   M50_DialStr_IC_card[90];

flash char  M50_CutDataLnk_str2[] = "AT+QICLOSE=1\r\n";


//  M66  Rec voice
flash char M50_VoiceRec_config[] = "ATI\r\n"; // 设置录音格式和录音质量
//  0C: 28 长度 18组 504
flash char M50_VoiceRec_start[] = "AT+QAUDRD=1,\"voice.amr\",3\r\n"; // 1: start rec    3: amr format
flash char M50_VoiceRec_stop[] = "AT+QAUDRD=0,\"voice.amr\",3\r\n";
flash char M50_VoiceRec_file_size[] = "AT+QFLST\r\n";
flash char M50_VoiceRec_delete[] = "AT+QFDEL=\"voice.amr\"\r\n";
flash char M50_VoiceRec_fileopen[] = "AT+QFOPEN=\"voice.amr\"\r\n";

static u8  M50_VoiceRec_sd_getAT[50] = "AT+QFREAD=%s,%d\r\n";
static u8  M50_VoiceRec_fileclose[] = "AT+QFCLOSE=%s\r\n";

#endif



#ifdef   M69_GSM

//----------  EM310 自带协议栈相关  -----------------------------
//   1.  通过命令和状态 初始化命令
flash char  SIM_Check_Str[] = "AT%TSIM\r\n"; //  检查SIM卡的存在
flash char  IMSI_Check_str[] = "AT+CIMI\r\n";
flash char  Signal_Intensity_str[] = "AT+CSQ\r\n"; // 信号强度 ，常用
flash char  CommAT_Str1[] = "ATV1\r\n";
flash char  CommAT_Str2[] = "ATE0\r\n";
flash char  CommAT_Str3[] = "AT+COPS?\r\n";
flash char  CommAT_Str4[] = "AT%SNFS=1\r\n";         // 设置音频输出通道选择 第二路
flash char  CommAT_Str5[] = "AT%NFI=1,10,0,0\r\n"; // 设置音频输入通道 选择第 二路
flash char  CommAT_Str6[] = "AT+CLVL=6\r\n";
flash char  CommAT_Str7[] = "AT%NFV=5\r\n"; // 扬声器设置  --没有音频功放 没用
flash char  CommAT_Str8[] = "AT%NFO=1,6,0\r\n"; //设置输出音量
flash char  CommAT_Str9[] = "AT%VLB=1\r\n"; //ATI
flash char  CommAT_Str10[] = "AT%NFW=1\r\n";  //   保存音频设置
flash char  CommAT_Str11[] = "AT+CGMR\r\n"; //"AT%RECFDEL\r\n";//"AT\r\n"; //
flash char  CommAT_Str12[] = "AT+CMGF=0\r\n"; 		///PDU模式
flash char  CommAT_Str13[] = "AT+CPMS=\"SM\",\"SM\",\"SM\"\r\n";
flash char  CommAT_Str14[] = "AT+CNMI=1,2\r\n"; 		///直接将短信输出
flash char  CommAT_Str15[] = "AT+CMGD=1,4\r\n";
flash char  CommAT_Str16[] = "AT+CSCA?\r\n";
flash char  CommAT_Str17[] = "AT+CCID\r\n";
flash char  CommAT_Str18[] = "AT+VGR=9\r\n"; // 通话最大音量


//    2.   通信模块登陆数据链路相关命令
flash char       DialInit1[]                          =    "AT+CREG?\r\n"; // "AT+CGACT=1,1\r\n"; S
flash char	DialInit2[]				=	"AT%IOMODE=1,2,1\r\n";
flash char	DialInit3[]				=	"AT%ETCPIP=\"user\",\"gprs\"\r\n";
flash char	DialInit4[] 			       =	"AT%ETCPIP?\r\n";
char	Dialinit_DNSR[50] 			=	"AT%DNSR=\"";     //  域名 up.gps960.com
char	Dialinit_DNSR2[50] 			=	"AT%DNSR=\"";     //  域名

flash char	DialInit6[] 			       =	"AT%NFO=1,6,0\r\n";
flash char	DialInit7[] 			       =	"AT\r\n";
flash char	DialInit8[] 			       =	"AT\r\n";//"AT+CGPADDR\r\n";

flash char	Open_TCP[] = "AT%ETCPIP=\"user\",\"gprs\"\r\n";

static u8	Send_TCP[18] = "AT%IPSENDX=1,\"";
static u8	Send_ISP[18] = "AT%IPSENDX=2,\"";
static u8	DialStr_Link1[90] = "AT%IPOPENX=1,\"TCP\",\""; //"ATD*99***1#\r\n"; AT%IPOPENX=1,"UDP","117.11.126.248",7106
static u8   DialStr_LinkAux[50] = "AT%IPOPENX=1,\"TCP\",\""; //"ATD*99***1#\r\n"; AT%IPOPENX=1,"UDP","117.11.126.248",7106
static u8	Dialinit_APN[40] = "AT+CGDCONT=1,\"IP\",\"";		//CMNET\"\r\n"; 	 // oranges Access Point Name
static u8   DialStr_IC_card[50] = "AT%IPOPENX=2,\"TCP\",\""; //  Link2




flash char  CutDataLnk_str1[] = "AT%IPCLOSE=3\r\n";
flash char  CutDataLnk_str2[] = "AT%IPCLOSE=2\r\n";
flash char  CutDataLnk_str3[] = "AT%IPCLOSE=1\r\n";
flash char  CutDataLnk_str4[] = "AT%IPCLOSE=5\r\n";
flash char  CutDataLnk_str5[] = "ATH\r\n";

#endif

//  M66  Rec voice
flash char VoiceRec_config[] = "AT%RECCFG=\"AMR\",0\r\n"; // 设置录音格式和录音质量
flash char VoiceRec_start[] = "AT%RECSTART=\""; //at%recstart="test1.amr",10
flash char VoiceRec_stop[] = "AT%RECSTOP\r\n"; 	 // %RECSTOP: 10,6824
flash char  VoiceRec_getdata[] = "AT%RECFGET=\"";        //at%recfget="test1.amr",100,100
flash char  VoiceRec_delFile[] = "AT%RECFDEL\r\n"; //  AT%RECFDEL="test1.amr"

