nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/gsm/Device_gsm.c
//-------  struct  variables -------------
GSM_POWER   GSM_PWR;
static IMSI_GET       IMSIGet;
COMM_AT               CommAT;
DATA_DIAL             DataDial;


ALIGN(RT_ALIGN_SIZE)
u8     GSM_rx[GSMRX_SIZE];
u16     GSM_rx_Wr = 0;
u16     gsm_rx_infolen = 0;
u8      gsm_rx_linknum = 0;
u8      gsm_rdy_2_rxEnable = 0; // 等待接收



u16     info_len = 0;
static u8  former_byte = 0;

static GSM_typeBUF GSM_INT_BUFF;
static GSM_typeBUF GSM_RX_BUFF;

u8  GSM_AsciiTx[GSM_AsciiTX_SIZE];
u16   GSM_AsciiTx_len = 0;

//-----  1 s timer  related below   ------
u16   one_second_couner = 0;
u8     Enable_UDP_sdFlag = 0;


u8    Dial_jump_State = 0; // 拨号过程中  状态跳转标志， DialInit5  DialInit6 到 DialInit7 的跳转标记
u8    Dnsr_state = 0; //  DNSR 状态   1: 表示在域名解析成功的前提下


//------- GPPRS 功能相关 ----------------
//u8 Datalink_close=0;  //挂断后不再登陆

//--------   电话性能指示 -------------------
u8  Ring_counter = 0; // ring   来电话，性能指示
u8  Calling_ATA_flag = 0; //     接听电话操作


//-------- TCP2 send ---------
u8     TCP2_ready_dial = 0;
u16    Ready_dial_counter2 = 0;
u16    TCP2_notconnect_counter = 0;
u8     TCP2_Connect = 0;
u8	  TCP2_sdFlag = 0;		//定时发送GPS位置信息标志
u16    TCP2_sdDuration = 50;
u8      TCP2_Coutner = 0; // 定时器计数
u8      TCP2_login = 0;     // TCP 建立好连接后的标志位
u8       Online_error_counter = 0; // 登网或在线情况下,连续出现错误计数器


//    TTS   相关
TTS              TTS_Var;  //  TTS 类型变量
ALIGN(RT_ALIGN_SIZE)
u8                AT_TTS[800];
u16               TTS_Len = 0;


//  Voice  Record

// u8  Debug_gsmnoack=0;
void Dial_Stage(T_Dial_Stage  Stage);
static void GSM_Process(u8 *instr, u16 len);
u32 GSM_HextoAscii_Convert(u8 *SourceHex, u16 SouceHexlen, u8 *Dest);

//=========================================================================
//    TTS  realated
u8    TTS_Get_Data(u8 *Instr, u16 LEN)    //  return   0   : OK     return   1 : busy
{
    // 1. check status
    if(TTS_Var.Playing)
    {
        memset(TTS_Var.HEX_BUF, 0, sizeof((const char *)TTS_Var.HEX_BUF));
        TTS_Var.HEX_len = LEN;
        memcpy(TTS_Var.HEX_BUF, Instr, LEN);
        TTS_Var.Save = 1;
        return  TTS_BUSY;

    }
    //  2.   HEX to  ASCII convert
    memset(TTS_Var.ASCII_BUF, 0, sizeof((const char *)TTS_Var.ASCII_BUF));

#ifdef M50_GSM
    if(Module_Type)
    {
        memcpy(TTS_Var.ASCII_BUF, Instr, LEN);
        TTS_Var.ASCII_Len = LEN ; // 长度
    }
    else
#endif
    {
        TTS_Var.ASCII_Len = GSM_HextoAscii_Convert(Instr, LEN, TTS_Var.ASCII_BUF);
        TTS_Var.ASCII_Len = (LEN << 1); // 长度乘以 2
    }

    //  3. cacu  timeout value
    TTS_Var.TimeOut_limt = LEN / 3 + 3; // 3个字每秒+ 3  秒保护时间
    TTS_Var.TimeCounter = 0;
    //  4.  ready to play
    TTS_Var.NeedtoPlay = 1;
    return  TTS_OK;
}
u8    TTS_Data_Play(void)
{
    u16   i = 0;
    //  1.  check status
    if(TTS_Var.Playing)
        return  TTS_BUSY;
    else if(TTS_Var.Save) //  2.  check  save  status
    {
        TTS_Var.Save = 0;
        //  3. HEX to  ASCII
        memset(TTS_Var.ASCII_BUF, 0, sizeof((const char *)TTS_Var.ASCII_BUF));
#ifdef M50_GSM
        if(Module_Type)
        {
            memcpy(TTS_Var.ASCII_BUF, TTS_Var.HEX_BUF, TTS_Var.HEX_len);
            TTS_Var.ASCII_Len = TTS_Var.HEX_len ; // 长度
        }
        else
#endif
        {
            TTS_Var.ASCII_Len = GSM_HextoAscii_Convert(TTS_Var.HEX_BUF, TTS_Var.HEX_len, TTS_Var.ASCII_BUF);
            TTS_Var.ASCII_Len = (TTS_Var.HEX_len << 1); // 长度乘以 2
        }
        //  4. cacu  timeout value
        TTS_Var.TimeOut_limt = TTS_Var.HEX_len / 3 + 3; // 3个字每秒+ 3  秒保护时间
        TTS_Var.TimeCounter = 0;
        //  5.  ready to play
        TTS_Var.NeedtoPlay = 1;
    }

    //   6.   play process
    if(( TTS_Var.NeedtoPlay	== 1) && (print_rec_flag == 0)) // 为了减小大电流，打印时候不播报
    {
        Speak_ON;   // 开功放
        TTS_Var.Playing = 1;
        //  head
        memset(AT_TTS, 0, sizeof(AT_TTS));
#ifdef M50_GSM
        if(Module_Type)
            strcat(AT_TTS, "AT+QTTS=2,\"");
        else
#endif
            strcat(AT_TTS, "AT%TTS=2,3,6,\"");
        TTS_Len = strlen(AT_TTS)	;
        //  info
        memcpy(AT_TTS + TTS_Len, TTS_Var.ASCII_BUF, TTS_Var.ASCII_Len);
        TTS_Len += TTS_Var.ASCII_Len;
        //  tail
#ifdef M50_GSM
        if(Module_Type)
        {
            memcpy((char *)AT_TTS + TTS_Len, "\",4\r\n", 5); // tail
            TTS_Len += 5;
        }
        else
#endif
        {
            memcpy((char *)AT_TTS + TTS_Len, "\"\r\n", 3); // tail
            TTS_Len += 3;
        }
        if( GB19056.workstate == 0)
        {
            for(i = 0; i < TTS_Len; i++)
                rt_kprintf("%c", AT_TTS[i]);
        }

        rt_hw_gsm_output_Data(AT_TTS, TTS_Len);

        WatchDog_Feed();
        delay_ms(30); // rt_thread_delay(RT_TICK_PER_SECOND/8);

        //---------------------
        TTS_Var.NeedtoPlay = 0;
    }
    return TTS_OK;
}

void   TTS_Play_End(void)
{
    TTS_Var.Playing = 0;
    TTS_Var.TimeCounter = 0;

    Speak_OFF;	   // 关闭功放
}
void TTS_Exception_TimeLimt(void)     //  单位: s
{
    //  TTS  播报异常 超时计数器
    if(TTS_Var.Playing)
    {
        TTS_Var.TimeCounter++;
        if(TTS_Var.TimeCounter > TTS_Var.TimeOut_limt)
        {
            TTS_Var.Playing = 0;
            TTS_Var.TimeCounter = 0;
            Speak_OFF;
        }
    }
}

u8  TTS_ACK_Error_Process(void)
{
    // 发送TTS  语音播报命令后返回Error 异常
    if(TTS_Var.Playing)
    {
        TTS_Var.Playing = 0;
        TTS_Var.TimeCounter = 0;
        return true;
    }
    else
        return false;
}

void TTS_play(u8 *instr)
{
    TTS_Get_Data(instr, strlen((const char *)instr));
    // rt_kprintf("\r\n    手动语音播报: %s\r\n",instr);
}
FINSH_FUNCTION_EXPORT(TTS_play, TTS play);

void gsm_power_cut(void)
{
    GSM_PWR.GSM_powerCounter = 0;
    GSM_PWR.GSM_power_over = 3;  // enable  GSM reset
    rt_kprintf(" \r\n  GSM 模块准备关闭!  \r\n");

