nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/gsm/Device_gsm.c
}
//FINSH_FUNCTION_EXPORT(gsm_power_cut, gsm_power_cut);



void AT_cmd_send_TimeOUT(void)
{
    // work  in    1  sencond
    if(CommAT.AT_cmd_sendState == enable)
    {
        CommAT.AT_cmd_send_timeout++;
        if(CommAT.AT_cmd_send_timeout > 70)
        {
            gsm_power_cut();
            CommAT.AT_cmd_send_timeout = 0;
            CommAT.AT_cmd_sendState = 0;
            rt_kprintf("AT  noack  reset GSM module\r\n");
        }
    }
}

void GSM_CSQ_timeout(void)
{
    CSQ_counter++;
    if(CSQ_counter >= CSQ_Duration)
    {
        CSQ_counter = 0;
        CSQ_flag = 1;
    }

}

u8 GSM_CSQ_Query(void)
{
    if((GSM_PWR.GSM_power_over > 0) && (GSM_PWR.GSM_power_over <= 2))
    {
        if((CSQ_flag == 1) && (MediaObj.Media_transmittingFlag == 0))
        {
            CSQ_flag = 0;
            delay_ms(100);
            rt_hw_gsm_output("AT+CSQ\r\n");    //检查信号强度
            if(GB19056.workstate == 0)
                rt_kprintf("AT+CSQ\r\n");
            return true;
        }
    }
    return false;
}




//-------------------------------------------------------------------------------
void  DataLink_MainSocket_set(u8 *IP, u16  PORT, u8 DebugOUT)
{
#ifdef M50_GSM

    if(Module_Type)
    {
        memset((char *)M50_DialStr_Link1, 0, sizeof(M50_DialStr_Link1)); // clear
        sprintf((char *)M50_DialStr_Link1, M50_DialStr_Link1_demo, 1, "TCP", IP[0], IP[1], IP[2], IP[3], PORT);

        if(DebugOUT)
        {
            rt_kprintf("		   Main Initial  Str:");
            rt_kprintf((char *)M50_DialStr_Link1);
        }
    }
    else
#endif
    {
        memset((char *)DialStr_Link1 + 20, 0, sizeof(DialStr_Link1) - 20);
        IP_Str((char *)DialStr_Link1 + 20, *( u32 * ) IP);

        strcat((char *) DialStr_Link1, "\"," );
        sprintf((char *)DialStr_Link1 + strlen((char const *)DialStr_Link1), "%u\r\n", PORT);

        if(DebugOUT)
        {
            rt_kprintf("		   Main Initial  Str:");
            rt_kprintf((char *)DialStr_Link1);
        }
    }
}

void  DataLink_AuxSocket_set(u8 *IP, u16  PORT, u8 DebugOUT)
{
#ifdef M50_GSM

    if(Module_Type)
    {
        memset((char *)M50_DialStr_LinkAux, 0, sizeof(M50_DialStr_LinkAux)); // clear
        sprintf((char *)M50_DialStr_LinkAux, M50_DialStr_LinkAux_demo, 1, "TCP", IP[0], IP[1], IP[2], IP[3], PORT);

        if(DebugOUT)
        {
            rt_kprintf("\r\n	辅IP   DialString : ");
            rt_kprintf((char *)M50_DialStr_LinkAux);
        }

    }
    else
#endif
    {
        memset((char *)DialStr_LinkAux + 20, 0, sizeof(DialStr_LinkAux) - 20);
        IP_Str((char *)DialStr_LinkAux + 20, *( u32 * ) IP);

        strcat((char *) DialStr_LinkAux, "\"," );
        sprintf((char *)DialStr_LinkAux + strlen((char const *)DialStr_LinkAux), "%u\r\n", PORT);

        if(DebugOUT)
        {
            rt_kprintf("\r\n  辅IP   DialString : ");
            rt_kprintf((char *)DialStr_LinkAux);
        }
    }
}
void  DataLink_IC_Socket_set(u8 *IP, u16  PORT, u8 DebugOUT)
{
#ifdef M50_GSM
    if(Module_Type)
    {
        memset((char *)M50_DialStr_IC_card, 0, sizeof(M50_DialStr_IC_card)); // clear
        sprintf((char *)M50_DialStr_IC_card, M50_DialStr_IC_card_demo, 2, "TCP", IP[0], IP[1], IP[2], IP[3], PORT);
        if(DebugOUT)
        {
            rt_kprintf("\r\n IC  DialString : ");
            rt_kprintf((char *)M50_DialStr_IC_card);
        }

    }
    else
#endif
    {
        memset((char *)DialStr_IC_card + 20, 0, sizeof(DialStr_IC_card) - 20);
        IP_Str((char *)DialStr_IC_card + 20, *( u32 * ) IP);

        strcat((char *) DialStr_IC_card, "\"," );
        sprintf((char *)DialStr_IC_card + strlen((char const *)DialStr_IC_card), "%u\r\n", PORT);

        if(DebugOUT)
        {
            rt_kprintf("\r\n IC  DialString : ");
            rt_kprintf((char *)DialStr_IC_card);
        }
    }
}

void  DataLink_IspSocket_set(u8 *IP, u16  PORT, u8 DebugOUT)
{
    u8 *regstr[30];

    memset((char *)regstr, 0, sizeof(regstr));
    IP_Str((char *)regstr, *( u32 * ) IP);

    sprintf(( char *)regstr, IP);

    if(DebugOUT)
        rt_kprintf("		  Aux Socket : %s\r\n", regstr);
}

void  DataLink_APN_Set(u8 *apn_str, u8 DebugOUT)
{

    memset(Dialinit_APN + APN_initSTR_LEN, 0, sizeof(Dialinit_APN) - APN_initSTR_LEN);
    memcpy(Dialinit_APN + APN_initSTR_LEN, apn_str, strlen((char const *)apn_str));
    strcat( (char *)Dialinit_APN, "\"\r\n" );

    if(DebugOUT)
    {
        rt_kprintf("\r\n APN 设置 :  ");
        rt_kprintf((const char *)Dialinit_APN);
    }

}


void  DataLink_DNSR_Set(u8 *Dns_str, u8 DebugOUT)
{
#ifdef M50_GSM
    memset(M50_Dialinit_DNSR + 13, 0, sizeof(M50_Dialinit_DNSR) - 13);
    memcpy(M50_Dialinit_DNSR + 13, Dns_str, strlen((char const *)Dns_str));
    strcat( M50_Dialinit_DNSR, "\"\r\n" );
#endif

    memset(Dialinit_DNSR + 9, 0, sizeof(Dialinit_DNSR) - 9);
    memcpy(Dialinit_DNSR + 9, Dns_str, strlen((char const *)Dns_str));
    strcat( Dialinit_DNSR, "\"\r\n" );

    if(DebugOUT)
    {
        rt_kprintf("\r\n		 域名1 设置 :	 ");
        rt_kprintf(Dialinit_DNSR);
    }
}


void  DataLink_DNSR2_Set(u8 *Dns_str, u8 DebugOUT)
{
#ifdef M50_GSM
    memset(M50_Dialinit_DNSR2 + 13, 0, sizeof(M50_Dialinit_DNSR2) - 13);
    memcpy(M50_Dialinit_DNSR2 + 13, Dns_str, strlen((char const *)Dns_str));
    strcat( M50_Dialinit_DNSR2, "\"\r\n" );
#endif

    memset(Dialinit_DNSR2 + 9, 0, sizeof(Dialinit_DNSR2) - 9);
    memcpy(Dialinit_DNSR2 + 9, Dns_str, strlen((char const *)Dns_str));
    strcat( Dialinit_DNSR2, "\"\r\n" );

    if(DebugOUT)
    {
        rt_kprintf("\r\n		Aux  域名设置 :	 ");
        rt_kprintf(Dialinit_DNSR2);
    }

}

void Gsm_RegisterInit(void)
{
    //--------   Power  Related   ---------
    GSM_PWR.GSM_PowerEnable = 1; // 开始使能
    GSM_PWR.GSM_powerCounter = 0;
    GSM_PWR.GSM_power_over = 0;

