nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/gsm/Device_gsm.c
    // --------  IMSI  -------------------
    memset((u8 *)&IMSIGet, 0, sizeof(IMSIGet));

    //---------- COMM AT ----------------
    memset((u8 *)&CommAT, 0, sizeof(CommAT));


    //----------- Data Dial ----------------
    memset((u8 *)&DataDial, 0, sizeof(DataDial));
    DataDial.start_dial_stateFLAG = 1; //important

    //---  Network Setting  Default ----
    DataLink_APN_Set(APN_String, 1);  // apn
    DataLink_DNSR_Set(DomainNameStr, 0);   // DNSR  MG323  没有
    DataLink_DNSR2_Set(DomainNameStr_aux, 0);
    DataLink_MainSocket_set(RemoteIP_main, RemotePort_main, 1);

    //  DataLink_AuxSocket_set(RemoteIP_aux, RemotePort_aux,1);
    Dial_Stage(Dial_Idle);
}


/* write one character to serial, must not trigger interrupt */
void rt_hw_gsm_putc(const char c)
{
    /*
    	to be polite with serial console add a line feed
    	to the carriage return character
    */
    //if (c=='\n')rt_hw_gps_putc('\r');
    //USART_SendData(UART4,  c);
    //while (!(UART4->SR & USART_FLAG_TXE));
    //UART4->DR = (c & 0x1FF);
    USART_SendData( UART4, c );
    while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
    {
    }

}

void rt_hw_gsm_output(const char *str)
{
    //   u16  len=0;
    /* empty console output */
    //--------  add by  nathanlnw ---------

    while (*str)
    {
        rt_hw_gsm_putc (*str++);
    }
    CommAT.AT_cmd_sendState = enable;
    /* len=strlen(str);
       while( len )
    {
    	USART_SendData( UART4, *str++ );
    	while (!(UART4->SR & USART_FLAG_TXE));
    	UART4->DR = (*str++ & 0x1FF);
    	len--;
    }  */
    //--------  add by  nathanlnw  --------
}

void rt_hw_gsm_output_Data(u8 *Instr, u16 len)
{
    unsigned int  infolen = 0;

    infolen = len;

    //--------  add by  nathanlnw ---------
    while (infolen)
    {
        rt_hw_gsm_putc (*Instr++);
        infolen--;
    }
    //--------  add by  nathanlnw  --------
    CommAT.AT_cmd_sendState = enable;
}
void Dial_Stage(T_Dial_Stage  Stage)
{
    // set the AT modem stage
    //if (DataDial.Dial_step == Stage) return;	// no change
    //
    DataDial.Dial_step = Stage;				//
    DataDial.Dial_step_RetryTimer = Dial_Dial_Retry_Time;
    DataDial.Dial_step_Retry = 0;
}
void  GSM_RxHandler(u8 data)
{
    static  u16  i = 0;

    rt_interrupt_enter( );
#ifdef M50_GSM
    if(gsm_rx_infolen)
    {
        if(gsm_rdy_2_rxEnable == 1) // first  rx
        {
            GSM_INT_BUFF.gsm_wr = 0; // clear first
            gsm_rdy_2_rxEnable = 0;
        }
        gsm_rx_infolen--;

        GSM_INT_BUFF.gsm_content[GSM_INT_BUFF.gsm_wr++] = data;

        if(gsm_rx_infolen == 0)	// rx end
        {

            switch(gsm_rx_linknum)
            {
            case  1:  // mainlink
                memcpy(GSM_HEX, GSM_INT_BUFF.gsm_content, GSM_INT_BUFF.gsm_wr);
                GSM_HEX_len = GSM_INT_BUFF.gsm_wr;
                Receive_DataFlag = 1;
                gsm_rx_linknum = 0;
                break;
            case  2:  // aux link
                memcpy(GSM_HEX, GSM_INT_BUFF.gsm_content, GSM_INT_BUFF.gsm_wr);
                GSM_HEX_len = GSM_INT_BUFF.gsm_wr;
                Receive_DataFlag = 1;
                gsm_rx_linknum = 0;
                break;
            }
            GSM_INT_BUFF.gsm_wr = 0;
        }
        else   //  rx  not  end
        {
            //---------------------------------------------------------
            if( GSM_INT_BUFF.gsm_wr == GSM_TYPEBUF_SIZE )
            {
                GSM_INT_BUFF.gsm_wr = 0;
            }
            GSM_INT_BUFF.gsm_content[GSM_INT_BUFF.gsm_wr ] = 0;
            //--------------------------------------------------------
        }

    }
    else
#endif
        if( ( data == 0x0a) && (former_byte == 0x0d ) ) /*遇到0d 0a 表明结束*/
        {
            GSM_INT_BUFF.gsm_content[GSM_INT_BUFF.gsm_wr++] = data;
            if( GSM_INT_BUFF.gsm_wr < 1400 )
            {

                /* 在中断里判断并处理*/
#ifdef M50_GSM
                if( strncmp( GSM_INT_BUFF.gsm_content, "+RECEIVE:", 9 ) == 0 ) //+RECEIVE: 1, 29
                {
                    /*解析出净信息,编译器会优化掉pdst*/
                    i = sscanf(GSM_INT_BUFF.gsm_content, "+RECEIVE: %d, %d", &gsm_rx_linknum, &gsm_rx_infolen );
                    if( i != 2 )
                    {
                        gsm_rx_linknum  = 0;
                        gsm_rx_infolen = 0;
                    }
                    gsm_rdy_2_rxEnable = 1;

                }
                else
#endif
                    rt_mq_send( &mq_GSM, (void *)&GSM_INT_BUFF, GSM_INT_BUFF.gsm_wr + 2 );
            }

            GSM_INT_BUFF.gsm_wr = 0;
        }
        else
        {
            GSM_INT_BUFF.gsm_content[GSM_INT_BUFF.gsm_wr++] = data;
            if( GSM_INT_BUFF.gsm_wr == GSM_TYPEBUF_SIZE )
            {
                GSM_INT_BUFF.gsm_wr = 0;
            }
            GSM_INT_BUFF.gsm_content[GSM_INT_BUFF.gsm_wr] = 0;
        }
    former_byte = data;
    rt_interrupt_leave( );

}


void  GSM_Buffer_Read_Process(void)
{
    // char ch;
    //-----------------------------------------------------
    rt_err_t	res;

    {
        res = rt_mq_recv( &mq_GSM, (void *)&GSM_RX_BUFF, 1400, 3 ); //等待100ms,实际上就是变长的延时,最长100ms
        if( res == RT_EOK )                                                     //收到一包数据
        {
            GSM_Process(GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr);
        }
    }

}
//------------------------  ASCII    HEX  convert   ---------------------
u8  HexValue (u8 inchar)
{
    switch(inchar)
    {
    case '0':
        return  0;
    case '1':
        return  1;
    case '2':
        return  2;
    case '3':
        return  3;
    case '4':
        return  4;
    case '5':
        return 5;
    case '6':
        return 6;
    case '7':
        return 7;
    case '8':
        return 8;
    case '9':
        return 9;
    case 'A':
        return 0x0A;
    case 'B':

        return 0x0B;
    case 'C':
        return 0x0C;
    case 'D':
        return 0x0D;
    case 'E':
        return 0x0E;
    case 'F':
        return 0x0F;
    default :
        // rt_kprintf("\r\n 转义有错误:%c \r\n",inchar);
        return  0xFF;
    }
}
//------------------------------- HEX to ASCII --------------------------------------
u32 GSM_HextoAscii_Convert(u8 *SourceHex, u16 SouceHexlen, u8 *Dest)
{
    u16 len_counter = 0;
    u16 dest_counter = 0;
    u8  c = 0;

    for(len_counter = 0; len_counter < SouceHexlen; len_counter++)
    {
        c = SourceHex[len_counter];

