nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/gsm/Device_gsm.c
        //---------------- High --------------------------------
        if((c >> 4) >= 10)
            Dest[dest_counter++] = 'A' + (c >> 4) - 10;
        else
            Dest[dest_counter++] = '0' + (c >> 4);

        Dest[dest_counter] = 0x00;

        //----------------- Low --------------------------------
        c = c & 0x0F;
        if(c >= 10)
            Dest[dest_counter++] = 'A' + c - 10;
        else
            Dest[dest_counter++] = '0' + c;
        Dest[dest_counter] = 0x00;
    }

    return dest_counter;
}
u16  GSM_AsciitoHEX_Convert(u8 *Src_str, u16 Src_infolen, u8 *Out_Str)
{
    u16 Counter = 0, Out_Str_Len = 0;
    u8  C = 0;

    Out_Str_Len = 0;
    /*
         if((u8)Src_infolen&0x01)
       	{
       	     rt_kprintf("\r\n      接收ASCII信息不正确!   %u  \r\n",Src_infolen);
       	}
      */
    for(Counter = 0; Counter < Src_infolen; Counter++)
    {
        //--------------------------------------------------
        if((Counter & 0x01) == 1)
        {
            C = HexValue(*(Src_str + Counter));
            if(C != 0xff)
            {
                Out_Str[Out_Str_Len] += C;
                Out_Str_Len++;
            }
            // else
            //  rt_kprintf("\r\n    Convert Error at:   %u  \r\n",Counter);
        }
        else
        {
            C = ((HexValue(*(Src_str + Counter))) << 4);
            Out_Str[Out_Str_Len] = (HexValue(*(Src_str + Counter))) << 4;
            if(C != 0xff)
            {
                Out_Str[Out_Str_Len] = C;
            }
            // else
            //  rt_kprintf("\r\n    Convert Error at2:   %u  \r\n",Counter);
        }

    }
    return Out_Str_Len;

}



void  Data_Send(u8 *DataStr, u16  Datalen, u8  Link_Num)
{
    u16  i = 0, packet_len = 0;
    u8   AT_send_str[20];
    //  4. Send
#ifdef M50_GSM
    if(Module_Type)
    {
        memset(AT_send_str, 0, sizeof(AT_send_str));

        if(Link_Num == 0)
        {
            sprintf((char *)AT_send_str, (char *)M50_Send_TCP, GPRS_infoWr_Tx);
            M50_Mainlink_send_over = 1; // 主链路发送信息
        }
        else
        {
            sprintf((char *)AT_send_str, (char *)M50_Send_ISP, GPRS_infoWr_Tx);
        }


        rt_hw_gsm_output(AT_send_str);
        delay_ms(100);// 给模块返回输出时间

        if((Photo_sdState.photo_sending == 0) && (GB19056.workstate == 0)) // 拍照时不输出相关信息
        {
            rt_kprintf(AT_send_str);
            OutPrint_HEX("GsmSend", DataStr, GPRS_infoWr_Tx);
        }
        rt_hw_gsm_output_Data(DataStr, GPRS_infoWr_Tx);
        // rt_hw_gsm_putc (0x1A);
        WatchDog_Feed();
        rt_thread_delay(RT_TICK_PER_SECOND / 10); //DF_delay_ms(100);

    }
    else
#endif
    {
        //  4.1  发送要发送的信息长度
        memset(GSM_AsciiTx, 0, sizeof(GSM_AsciiTx));
        if(Link_Num == 0)
        {
            strcat((char *)GSM_AsciiTx, Send_TCP);      // head
            packet_len = strlen((const char *)Send_TCP);
        }
        else
        {
            strcat((char *)GSM_AsciiTx, Send_ISP);      // head
            packet_len = strlen((const char *)Send_ISP);
        }
        //  infomation
        WatchDog_Feed();
        GSM_AsciiTx_len = GSM_HextoAscii_Convert( DataStr, Datalen, GSM_AsciiTx + packet_len);
        packet_len += GSM_AsciiTx_len;
        strcat((char *)GSM_AsciiTx, "\"\r\n");  // tail
        WatchDog_Feed();
        packet_len += 3;

        // 4.2 发送信息内容1
        //   if(DispContent==2)
        if((Photo_sdState.photo_sending == 0) && (GB19056.workstate == 0)) // 拍照时不输出相关信息
        {
            for(i = 0; i < packet_len; i++)
                rt_kprintf("%c", GSM_AsciiTx[i]);
        }
        rt_hw_gsm_output_Data(GSM_AsciiTx, packet_len);
        WatchDog_Feed();
        rt_thread_delay(RT_TICK_PER_SECOND / 10); //DF_delay_ms(100);
    }
}

void End_Datalink(void)
{
    if(1 == DataLink_EndFlag)
    {
        TCP2_Connect = 0;
        DataLink_Online = disable; // off line

        DataLink_EndCounter++;
        if(DataLink_EndCounter == 2)
        {
            //rt_kprintf(" Ready to escape gprs \r\n");
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output(M50_CutDataLnk_str2);
            else
#endif
                rt_hw_gsm_output(CutDataLnk_str2);
            if(GB19056.workstate == 0)
                rt_kprintf(CutDataLnk_str2);
            DataDial.Dial_step_Retry = 0;
            DataDial.Dial_step_RetryTimer = Dial_Dial_Retry_Time;
        }
        else if(DataLink_EndCounter == 3)
        {
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output("AT+QICLOSE=2\r\n");
            else
#endif
                rt_hw_gsm_output(CutDataLnk_str3);	// 关闭掉Internet
            //  rt_kprintf(CutDataLnk_str3);	// 关闭掉Internet
            DataDial.Dial_step_Retry = 0;
            DataDial.Dial_step_RetryTimer = Dial_Dial_Retry_Time;

        }
        else if(DataLink_EndCounter == 5)
        {
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output("AT+QICLOSE=5\r\n");
            else
#endif
                rt_hw_gsm_output(CutDataLnk_str4);
            //rt_kprintf(CutDataLnk_str4);
            DataDial.Dial_step_Retry = 0;
            DataDial.Dial_step_RetryTimer = Dial_Dial_Retry_Time;
        }
        if(DataLink_EndCounter == 8)
        {
            rt_hw_gsm_output(CutDataLnk_str5);
            if(GB19056.workstate == 0)
                rt_kprintf(CutDataLnk_str5);
            DataDial.Dial_step_Retry = 0;
            DataDial.Dial_step_RetryTimer = Dial_Dial_Retry_Time;
        }
        else if(DataLink_EndCounter > 10)
        {
            DataLink_EndCounter = 0;
            DataLink_EndFlag = 0;
            //-----------------------------
            CommAT.Initial_step = 0;
            CommAT.Total_initial = 0;
            Redial_Init();
            ModuleStatus &= ~Status_GPRS;
            if(GB19056.workstate == 0)
                rt_kprintf(" Redial Start\r\n");
            //-----------------------------
        }
    }

