nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/gsm/Device_gsm.c
}

void  ISP_Timer(void)
{
    if((BD_ISP.ISP_running == 1) && DataLink_Status())
    {
        BD_ISP.ISP_runTimer++;
        if(BD_ISP.ISP_runTimer > 350)
        {
            BD_ISP.ISP_runTimer = 0;
            BD_ISP.ISP_running = 0; //  clear
            SD_ACKflag.f_BD_ISPResualt_0108H = 2;
            rt_kprintf("\r\n 升级下发超时，升级失败\r\n");

        }
    }

}

u8  GPRS_GSM_PowerON(void)
{
    /*
              EM310开关机流程
              powerkey 拉低 50ms 开机  然后再拉低50ms关机
    */
    if(GSM_PWR.GSM_power_over)
        return 1;

    GSM_PWR.GSM_powerCounter += 50;
#if 0
    if((GSM_PWR.GSM_powerCounter >= 10) && (GSM_PWR.GSM_powerCounter < 300))
    {
        GPIO_ResetBits(GPIOD, GPRS_GSM_Power);   // 关电
        GPIO_ResetBits(GPIOD, GPRS_GSM_PWKEY);     //  PWK 低
        // rt_kprintf(" step 1\r\n");
    }
    if((GSM_PWR.GSM_powerCounter >= 300) && (GSM_PWR.GSM_powerCounter < 400))
    {
        GPIO_SetBits(GPIOD, GPRS_GSM_Power);   //  开电
        GPIO_SetBits(GPIOD, GPRS_GSM_PWKEY);  //  PWK低
        //  rt_kprintf(" step 2\r\n");

    }
    if((GSM_PWR.GSM_powerCounter >= 400) && (GSM_PWR.GSM_powerCounter < 700))
    {
        GPIO_SetBits(GPIOD, GPRS_GSM_Power);   //  开电
        GPIO_ResetBits(GPIOD, GPRS_GSM_PWKEY);   //  PWK 高
        //rt_kprintf(" step 3\r\n");
        gps_onoff(1);  // Gps module Power on	GPS 模块开电
    }
    if((GSM_PWR.GSM_powerCounter >= 700) && (GSM_PWR.GSM_powerCounter < 900))
    {
        GPIO_SetBits(GPIOD, GPRS_GSM_PWKEY);  //  PWK低
        //rt_kprintf(" step 4\r\n");
    }
    if((GSM_PWR.GSM_powerCounter >= 900) && (GSM_PWR.GSM_powerCounter < 1100))
    {
        GPIO_ResetBits(GPIOD, GPRS_GSM_PWKEY);     //  PWK 高
        //rt_kprintf(" step 5\r\n");
    }
    if(GSM_PWR.GSM_powerCounter >= 1200)
    {
        rt_kprintf("         %s", "--GPRS Power over\r\n ");
        GSM_PWR.GSM_PowerEnable = 0;
        GSM_PWR.GSM_powerCounter = 0;
        GSM_PWR.GSM_power_over = 5; // ready ati
        CSQ_Duration = 200; // 查询间隔加长

        // -----  ack  timeout    clear
        CommAT.AT_cmd_send_timeout = 0;
        CommAT.AT_cmd_sendState = 0;
        //-------add for re g
    }

#endif

#ifdef M50_GSM

    if((GSM_PWR.GSM_powerCounter >= 10) && (GSM_PWR.GSM_powerCounter < 300))
    {
        GPIO_ResetBits(GPIOD, GPRS_GSM_Power);	 // 关电
        GPIO_ResetBits(GPIOD, GPRS_GSM_PWKEY);		//	PWK 低

    }
    if((GSM_PWR.GSM_powerCounter >= 300) && (GSM_PWR.GSM_powerCounter < 400))
    {
        GPIO_SetBits(GPIOD, GPRS_GSM_Power);	//	开电
        GPIO_SetBits(GPIOD, GPRS_GSM_PWKEY);  //  PWK低
        gps_onoff(1);  // Gps module Power on   GPS 模块开电
    }
    if((GSM_PWR.GSM_powerCounter >= 400) && (GSM_PWR.GSM_powerCounter < 700))
    {
        GPIO_SetBits(GPIOD, GPRS_GSM_Power);   //  开电
        GPIO_SetBits(GPIOD, GPRS_GSM_PWKEY);  //  PWK低
    }
    if((GSM_PWR.GSM_powerCounter >= 700) && (GSM_PWR.GSM_powerCounter < 800))
    {
        GPIO_ResetBits(GPIOD, GPRS_GSM_PWKEY);		//	PWK 高
    }
    if(GSM_PWR.GSM_powerCounter >= 900)
    {
        rt_kprintf("		  %s", "--GPRS Power over\r\n ");
        GSM_PWR.GSM_PowerEnable = 0;
        GSM_PWR.GSM_powerCounter = 0;
        GSM_PWR.GSM_power_over = 5;
        //-------add for re g
    }



#endif
    return   0;
}

void Moudule_Init_Select(u8 *dest, flash char *M50, flash char *M69)
{
#ifdef M50_GSM
    if(Module_Type)
        memcpy(dest, M50, strlen(M50));
    else
#endif
        memcpy(dest, M69, strlen(M69));
    rt_hw_gsm_output((const char *)dest);
}

void GPRS_GSM_PowerOFF_Working(void)
{
    if(GSM_PWR.GSM_power_over != 3)
        return ;

    GSM_PWR.GSM_powerCounter++;

    if(GSM_PWR.GSM_powerCounter <= 3)
    {
        GPIO_SetBits(GPIOD, GPRS_GSM_Power);   //  开电
        GPIO_SetBits(GPIOD, GPRS_GSM_PWKEY);     //  PWK 低
        //	   rt_kprintf("\r\n 关电 --低 300ms\r\n");
    }
    if((GSM_PWR.GSM_powerCounter > 3) && (GSM_PWR.GSM_powerCounter <= 20))
    {
        GPIO_SetBits(GPIOD, GPRS_GSM_Power);   //  开电
        GPIO_ResetBits(GPIOD, GPRS_GSM_PWKEY);     //  PWK 高
        //  rt_kprintf("\r\n 关电 --高\r\n");
    }

    if(GSM_PWR.GSM_powerCounter > 20)
    {
        GSM_PWR.GSM_powerCounter = 0;
        GSM_PWR.GSM_power_over = 0;
        DataLink_Online = 0;        // 断开连接
        ModuleStatus &= ~Status_GPRS;
        rt_kprintf("\r\n 关模块完毕转入  开机模式\r\n");
    }

}

void GSM_Module_TotalInitial(u8 Invalue)
{
    u8 cmd_str[50];

    //----------  Total_initial ------------
    if(CommAT.Total_initial == 1)
    {
        if( CommAT.Execute_enable)
        {
            memset(cmd_str, 0, sizeof(cmd_str));
            switch(CommAT.Initial_step)
            {
            case 0:
                Moudule_Init_Select(cmd_str, M50_CommAT_Str1, CommAT_Str1);
                //rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 1:
                Moudule_Init_Select(cmd_str, M50_CommAT_Str2, CommAT_Str2);
                //rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;

            case 2:/* Query Operator */

                memcpy(cmd_str, CommAT_Str3, strlen(CommAT_Str3));  //  通用命令
                rt_hw_gsm_output((const char *)cmd_str);
                //CommAT.Initial_step++;
                break;
            case 3:
                Moudule_Init_Select(cmd_str, M50_CommAT_Str4, CommAT_Str4);
                // rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 4:
                Moudule_Init_Select(cmd_str, M50_CommAT_Str5, CommAT_Str5);
                // rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 5:
                Moudule_Init_Select(cmd_str, M50_CommAT_Str8, CommAT_Str8);
                rt_hw_gsm_output((const char *)cmd_str);
                CommAT.Initial_step++;
                break;
            case 6:
                Moudule_Init_Select(cmd_str, M50_CommAT_Str7, CommAT_Str7);
                //rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 7:
                Moudule_Init_Select(cmd_str, M50_CommAT_Str11, CommAT_Str11);
                // rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 8:
                Moudule_Init_Select(cmd_str, M50_CommAT_Str9, CommAT_Str9);
                // rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 9:
                Moudule_Init_Select(cmd_str, CommAT_Str16, CommAT_Str10);
                //  rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 10:
                //  配置语音录音参数
                Moudule_Init_Select(cmd_str, M50_CommAT_Str6, VoiceRec_config);
                // rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 11:
                Moudule_Init_Select(cmd_str, M50_CommAT_Str12, CommAT_Str12);
                //rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 12:
                Moudule_Init_Select(cmd_str, M50_CommAT_Str13, CommAT_Str13);
                // rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 13:
                Moudule_Init_Select(cmd_str, M50_CommAT_Str14, CommAT_Str14);
                // rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 14:
                memcpy(cmd_str, CommAT_Str15, strlen(CommAT_Str15));
                /// rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 15:
                Moudule_Init_Select(cmd_str, M50_CommAT_Str1, CommAT_Str16);
                //  rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 16:
                memcpy(cmd_str, Signal_Intensity_str, strlen(Signal_Intensity_str));
                rt_hw_gsm_output((const char *)cmd_str);
                break;
            case 17://  CCID /
                Moudule_Init_Select(cmd_str, M50_CommAT_Str1, CommAT_Str17);
                // rt_hw_gsm_output((const char*)cmd_str);

                if(Login_Menu_Flag == 1)     // 先初始化然后再执行拨号。保证短息OK
                    CommAT.Initial_step++;
                break;
            case 18://  信号强度 /

                Moudule_Init_Select(cmd_str, M50_CommAT_Str1, CommAT_Str16);
                // rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 19:
                Moudule_Init_Select(cmd_str, M50_CommAT_Str1, CommAT_Str18);
                //  rt_hw_gsm_output((const char*)cmd_str);
                CommAT.Initial_step++;
                break;
            case 20:
            case 21:
            case 22:
                CommAT.Initial_step++;
                break;
            case 23:/*开始能拨号*/
                if((DispContent) && (GB19056.workstate == 0))
                    rt_kprintf("AT_Start\r\n");
                CommAT.Initial_step = 0;
                CommAT.Total_initial = 0;

                DataDial.Dial_ON = enable; //  进入  Data   状态
                DataDial.Pre_Dial_flag = 1;  // Convert to  DataDial State
                Dial_Stage(Dial_DialInit0);
                break;
            default:
                break;

