nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/gsm/Device_gsm.c
            }
            if((DispContent) && (GB19056.workstate == 0) && (CommAT.Initial_step < 20))
                rt_kprintf(cmd_str);
            CommAT.Execute_enable = 0;
        }
    }

}

void Redial_Init(void)
{
    //----------- Data Dial ----------------
    memset((u8 *)&DataDial, 0, sizeof(DataDial));
    DataDial.start_dial_stateFLAG = 1; //important
    DataDial.Dial_ON = enable; //  进入  Data   状态
    DataDial.Pre_Dial_flag = 1;  // Convert to  DataDial State
    Dial_Stage(Dial_DialInit0);
}

void  Dial_step_Single_10ms_timer(void)
{
    //    没在数据状态下，和 成功登陆上后不进行处理
    if( (DataDial.Dial_ON == 0) || (DataDial.Dial_step == Dial_Idle) )
        return;

    if (DataDial.Dial_step_RetryTimer >= 3)
        DataDial.Dial_step_RetryTimer -= 3;
    else
        DataDial.Dial_step_RetryTimer = 0;
}

void  Get_GSM_HexData(u8  *Src_str, u16 Src_infolen, u8 link_num)
{
    // u16   i=0;
    //  1.  Check wether   Instr   is  need   to  convert     Exam:  ASCII_2_HEX
    GSM_HEX_len = GSM_AsciitoHEX_Convert(Src_str, Src_infolen, GSM_HEX);
    //  2 .  Realse   sem
    Receive_DataFlag = 1;
}
void Moudule_DialStr_Select(u8 *dest, flash char *M50, flash char *M69)
{
#ifdef M50_GSM
    if(Module_Type)
        memcpy(dest, M50, strlen(M50));
    else
#endif
        memcpy(dest, M69, strlen(M69));
}

void DataLink_Process(void)
{
    u8  len = 0, i = 0;
    u8  cmd_str[50];

    // state  filter  1:   没在数据状态下，和 成功登陆上后不进行处理
    if( (DataDial.Dial_ON == 0) || (DataDial.Dial_step == Dial_Idle) )
        return;
    // state  filter  2:  	单步延时还没有到
    if (DataDial.Dial_step_RetryTimer )
        return;						   // not time to retry
    // state  filter  3:
    if (DataDial.Dial_step_Retry >= Dial_Step_MAXRetries)
    {

        if((DataDial.Dial_step == Dial_DNSR1) || (DataDial.Dial_step == Dial_DNSR2))
        {
            DataDial.Dial_step++;
        }
        else
        {
            //---------------------------------------
            DataDial.Connect_counter++;
            if( DataDial.Connect_counter > 4)
            {
                DataDial.Pre_Dial_flag = 1; 	 //--- 重新拨号
                DataDial.Pre_dial_counter = 0;
                //rt_kprintf("\r\n  RetryDialcounter>=4 重新拨号\r\n");
            }
            Dial_Stage(Dial_DialInit0);    // Clear   from  Dial  start
        }
        DataDial.Dial_step_Retry = 0;
        DataDial.Dial_step_RetryTimer = 0;
        //  rt_kprintf("\r\nDataDial.Dial_step_Retry>= Dial_Step_MAXRetries ,redial \r\n");
        return;
    }
    //----------  主连接重试2次 失败切换到辅连接
    if((DataDial.Dial_step == Dial_MainLnk) && (DataDial.Dial_step_Retry > 2))
    {
        i = 0;
        if(Dnsr_state == 0)
        {
            // rt_thread_delay(10);
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output(M50_CutDataLnk_str2);
            else
#endif
                rt_hw_gsm_output("AT%IPCLOSE=1\r\n");
            WatchDog_Feed();
            delay_ms(100);//rt_thread_delay(10);
            Dial_Stage(Dial_AuxLnk);
            DataLink_AuxSocket_set(RemoteIP_aux, RemotePort_main, 0);

        }
    }



    //  work  on
    if(DataDial.Dial_ON)
    {
        switch(DataDial.Dial_step)
        {
        case Dial_DialInit0:
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output(M50_DialInit4);
            else
#endif
                rt_hw_gsm_output(DialInit1);
            //-----------------------------------------
            DataDial.start_dial_stateFLAG = 1;
            //-----------------------------------------
            DataDial.Dial_step_RetryTimer = Dial_Dial_Retry_Time;
            DataDial.Dial_step_Retry++;
            //  Debug

            memset(cmd_str, 0, sizeof(cmd_str));
            Moudule_DialStr_Select(cmd_str, M50_DialInit4, DialInit1);
            len = strlen((const char *)cmd_str);
            if(GB19056.workstate == 0)
            {
                for(i = 0; i < len; i++)
                    rt_kprintf("%c", cmd_str[i]);
            }
            break;
        case Dial_DialInit1:
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output(M50_DialInit1);
            else
#endif
                rt_hw_gsm_output((const char *)Dialinit_APN);
            DataDial.Dial_step_RetryTimer = Dial_max_Timeout;
            DataDial.Dial_step_Retry++;

            memset(cmd_str, 0, sizeof(cmd_str));
            Moudule_DialStr_Select(cmd_str, M50_DialInit1, Dialinit_APN);
            len = strlen((const char *)cmd_str);
            if(GB19056.workstate == 0)
            {
                for(i = 0; i < len; i++)
                    rt_kprintf("%c", cmd_str[i]);
            }
            break;
        case Dial_DialInit2:
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output(Dialinit_APN);
            else
#endif
                rt_hw_gsm_output(DialInit2);
            DataDial.Dial_step_RetryTimer = Dial_Timeout;
            DataDial.Dial_step_Retry++;

            memset(cmd_str, 0, sizeof(cmd_str));

            Moudule_DialStr_Select(cmd_str, Dialinit_APN, DialInit2);
            len = strlen((const char *)cmd_str);
            if(GB19056.workstate == 0)
            {
                for(i = 0; i < len; i++)
                    rt_kprintf("%c", cmd_str[i]);
            }
            break;
        case  Dial_DialInit3:
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output(M50_DialInit2);
            else
#endif
                rt_hw_gsm_output(DialInit3);
            DataDial.Dial_step_RetryTimer = Dial_max_Timeout;
            DataDial.Dial_step_Retry++;

            memset(cmd_str, 0, sizeof(cmd_str));

            Moudule_DialStr_Select(cmd_str, M50_DialInit2, DialInit3);
            len = strlen((const char *)cmd_str);
            if(GB19056.workstate == 0)
            {
                for(i = 0; i < len; i++)
                    rt_kprintf("%c", cmd_str[i]);
            }

            break;
        case Dial_DialInit4:
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output(M50_DialInit3);
            else
#endif
                rt_hw_gsm_output(DialInit6); // AT
            DataDial.Dial_step_RetryTimer = Dial_Dial_Retry_Time;
            DataDial.Dial_step_Retry++;

            memset(cmd_str, 0, sizeof(cmd_str));

            Moudule_DialStr_Select(cmd_str, M50_DialInit3, DialInit6);
            len = strlen((const char *)cmd_str);

