nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/gsm/Device_gsm.c
            if(GB19056.workstate == 0)
            {
                for(i = 0; i < len; i++)
                    rt_kprintf("%c", cmd_str[i]);
            }
            break;

        case Dial_DialInit5:
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output(DialInit1);
            else
#endif
                rt_hw_gsm_output(DialInit4);
            DataDial.Dial_step_RetryTimer = Dial_Dial_Retry_Time;
            DataDial.Dial_step_Retry++;
            memset(cmd_str, 0, sizeof(cmd_str));
            Moudule_DialStr_Select(cmd_str, DialInit1, DialInit4);
            len = strlen((const char *)cmd_str);
            if(GB19056.workstate == 0)
            {
                for(i = 0; i < len; i++)
                    rt_kprintf("%c", cmd_str[i]);
            }

            break;
        case Dial_DialInit6:
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output(M50_CommAT_Str1);
            else
#endif
                rt_hw_gsm_output(DialInit8);  // Query  IP
            DataDial.Dial_step_RetryTimer = Dial_Dial_Retry_Time;
            DataDial.Dial_step_Retry++;
            memset(cmd_str, 0, sizeof(cmd_str));

            Moudule_DialStr_Select(cmd_str, M50_CommAT_Str1, DialInit8);
            len = strlen((const char *)cmd_str);
            if(GB19056.workstate == 0)
            {
                for(i = 0; i < len; i++)
                    rt_kprintf("%c", cmd_str[i]);
            }
            break;
        case Dial_DNSR1:
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output(M50_Dialinit_DNSR);
            else
#endif
                rt_hw_gsm_output(Dialinit_DNSR);  // main DNSR
            KorH_check();
            DataDial.Dial_step_RetryTimer = Dial_max_Timeout;
            DataDial.Dial_step_Retry++;
            if(GB19056.workstate == 0)
                rt_kprintf("\r\n   ----- Link  main  DNSR ----\r\n");
            memset(cmd_str, 0, sizeof(cmd_str));

            Moudule_DialStr_Select(cmd_str, M50_Dialinit_DNSR, Dialinit_DNSR);
            len = strlen((const char *)cmd_str);
            if(GB19056.workstate == 0)
            {
                for(i = 0; i < len; i++)
                    rt_kprintf("%c", cmd_str[i]);
            }
            Dial_jump_State = 7;
            Dnsr_state = 1; //表示DNSR 状态下拨号
            break;
        case Dial_DNSR2:
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output(M50_Dialinit_DNSR2);
            else
#endif
                rt_hw_gsm_output(Dialinit_DNSR2);  // Aux DNSR
            DataDial.Dial_step_RetryTimer = Dial_max_Timeout;
            DataDial.Dial_step_Retry++;
            if(GB19056.workstate == 0)
                rt_kprintf("\r\n   ----- Link  Aux  DNSR ----\r\n");
            memset(cmd_str, 0, sizeof(cmd_str));
            Moudule_DialStr_Select(cmd_str, M50_Dialinit_DNSR2, Dialinit_DNSR2);
            len = strlen((const char *)cmd_str);
            if(GB19056.workstate == 0)
            {
                for(i = 0; i < len; i++)
                    rt_kprintf("%c", cmd_str[i]);
            }
            Dial_jump_State = 8;
            Dnsr_state = 1; //表示DNSR 状态下拨号
            break;
        case Dial_DialInit7:
#ifdef M50_GSM
            if(Module_Type)
                rt_hw_gsm_output(M50_CommAT_Str1);
            else
#endif
                rt_hw_gsm_output(DialInit8);  // Query  IP
            DataDial.Dial_step_RetryTimer = Dial_Dial_Retry_Time;
            DataDial.Dial_step_Retry++;
            memset(cmd_str, 0, sizeof(cmd_str));

            Moudule_DialStr_Select(cmd_str, M50_CommAT_Str1, DialInit8);
            len = strlen((const char *)cmd_str);
            if(GB19056.workstate == 0)
            {
                for(i = 0; i < len; i++)
                    rt_kprintf("%c", cmd_str[i]);
            }
            break;
        case Dial_MainLnk:   // rt_hw_gsm_output(DialStr_Link1);
            if( Dnsr_state == 0) //表示DNSR 状态下拨号
            {
                if(GB19056.workstate == 0)
                    rt_kprintf("\r\n Dial  orginal   Mainlink\r\n");
                DataLink_MainSocket_set(RemoteIP_main, RemotePort_main, 1);
            }

            DataDial.Dial_step_RetryTimer = 800;
            DataDial.Dial_step_Retry++;


            memset(cmd_str, 0, sizeof(cmd_str));

            Moudule_DialStr_Select(cmd_str, M50_DialStr_Link1, DialStr_Link1);
            len = strlen((const char *)cmd_str);
            for(i = 0; i < len; i++)
            {
                rt_hw_gsm_putc (cmd_str[i]);
            }
            if(GB19056.workstate == 0)
            {
                for(i = 0; i < len; i++)
                {
                    rt_kprintf("%c", cmd_str[i]);
                }
            }
            break;
        case Dial_AuxLnk:   // rt_hw_gsm_output(DialStr_IC_card);
            DataDial.Dial_step_RetryTimer = 1000;
            DataDial.Dial_step_Retry++;

            memset(cmd_str, 0, sizeof(cmd_str));

            Moudule_DialStr_Select(cmd_str, M50_DialStr_LinkAux, DialStr_LinkAux);
            len = strlen((const char *)cmd_str);
            for(i = 0; i < len; i++)
            {
                rt_hw_gsm_putc (cmd_str[i]);
            }
            if(GB19056.workstate == 0)
            {
                for(i = 0; i < len; i++)
                {
                    rt_kprintf("%c", cmd_str[i]);
                }
            }
            break;
        case   Dial_ISP:
            DataDial.Dial_step_RetryTimer = Dial_max_Timeout;
            DataDial.Dial_step_Retry++;

            memset(cmd_str, 0, sizeof(cmd_str));

            Moudule_DialStr_Select(cmd_str, M50_DialStr_IC_card, DialStr_IC_card);
            len = strlen((const char *)cmd_str);
            for(i = 0; i < len; i++)
            {
                rt_hw_gsm_putc (cmd_str[i]);
            }
            rt_kprintf("\r\n	----- Link	IC ----\r\n");
            for(i = 0; i < len; i++)
            {
                rt_kprintf("%c", cmd_str[i]);
            }
            break;
        default:
            break;
        }

