nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/gsm/Device_gsm.c
    }



}

static void GSM_Process(u8 *instr, u16 len)
{
    u8	ok = false, dnsrok = false;
    u8	error = false;
    u8	failed = false;
    u8	connect = false, connect_2 = false;
    u16  i = 0, j = 0, q = 0; //,len=0;//j=0;
    u8 reg_str[80];
    //----------------------  Debug -------------------------
    // if(DispContent==2)
    memset(GSM_rx, 0, sizeof((const char *)GSM_rx));
    memcpy(GSM_rx, instr, len);

    if((BD_ISP.ISP_running == 0) && (GB19056.workstate == 0))
    {
        rt_kprintf("\r\n");
        for(i = 0; i < len; i++)
            rt_kprintf("%c", GSM_rx[i]);
    }

    // -----  ack  timeout    clear
    CommAT.AT_cmd_send_timeout = 0;
    CommAT.AT_cmd_sendState = 0;

    //-------------------------------------------------------------------------------------------------------------------

#ifdef M50_GSM
    if (strncmp((char *)GSM_rx, "Quectel_M50", 11) == 0)
    {
        /*
        	 模块重新启动了，有些状态要还原到相应状态 ，-- 需要做处理
         */
        Module_Type = M50_GSM;
        GSM_PWR.GSM_PowerEnable = 0;
        GSM_PWR.GSM_powerCounter = 0;
        GSM_PWR.GSM_power_over = 1;


        DataLink_APN_Set(APN_String, 1);  // apn
        DataLink_DNSR_Set(DomainNameStr, 0);   // DNSR	MG323  没有
        DataLink_DNSR2_Set(DomainNameStr_aux, 0);
        DataLink_MainSocket_set(RemoteIP_main, RemotePort_main, 1);

        if(GB19056.workstate == 0)
            rt_kprintf("\r\n   模块类型是: Quectel_M50\r\n");
    }
#endif
    if (strncmp((char *)GSM_rx, "M69", 2) == 0)
    {
        Module_Type = M69_GSM;
        GSM_PWR.GSM_PowerEnable = 0;
        GSM_PWR.GSM_powerCounter = 0;
        GSM_PWR.GSM_power_over = 1;

        DataLink_APN_Set(APN_String, 1);  // apn
        DataLink_DNSR_Set(DomainNameStr, 0);   // DNSR	MG323  没有
        DataLink_DNSR2_Set(DomainNameStr_aux, 0);
        DataLink_MainSocket_set(RemoteIP_main, RemotePort_main, 1);
        if(GB19056.workstate == 0)
            rt_kprintf("\r\n   模块类型是: M69 \r\n");
    }
    if(strncmp((char *)GSM_rx, "%IPDATA:1", 9) == 0) // UDP	  有数据过来了
    {
        //exam:	%IPDATA:1,16,"6473616466617365"
        for(i = 0; i < 20; i++) //  从前20个字节中找第一个"
        {
            if(GSM_rx[i] == '"')
                break;
        }
        info_len = len - i - 5;
        WatchDog_Feed();
        Get_GSM_HexData(GSM_rx + i + 1, info_len, 0);
        goto RXOVER;
    }
    if((strncmp((char *)GSM_rx, "%TTS: 0", 7) == 0) || (strncmp((char *)GSM_rx, "+QTTS:0", 7) == 0))
    {
        // M50

        TTS_Play_End();
        if(GB19056.workstate == 0)
            rt_kprintf("\r\n   TTS  播放完毕\r\n");
        Speak_OFF;
    }
#ifdef M50_GSM
    else if(strncmp((char *)GSM_rx, "SEND OK", 7) == 0)	 // 链路 1  TCP 发送OK
    {
        if(M50_Mainlink_send_over)
        {
            M50_Mainlink_send_over = 0;
        }
        // Recorder_JudgeOK();
    }
#endif
#ifdef  SMS_ENABLE
    //--------      SMS  service  related Start  -------------------------------------------
    //+CMTI: "SM",1            +CMTI: "SM",1
    if( strncmp( (char *)GSM_rx, "+CMTI: \"SM\",", 12 ) == 0 )
    {
        if(GB19056.workstate == 0)
            rt_kprintf( "\r\n收到短信:" );
        j = sscanf( GSM_rx + 12, "%d", &i );
        if( j )
        {
            SMS_Rx_Notice(i);
        }
    }
    else if( strncmp( (char *)GSM_rx, "+CMT: ", 6 ) == 0 )
    {
        if(GSM_rx[6] == ',')		///PDU模式
        {
            if( RT_EOK == rt_mq_recv( &mq_GSM, (void *)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )   //等待1000ms,实际上就是变长的延时,最长1000ms
            {
                memset( GSM_rx, 0, sizeof( GSM_rx ) );
                memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
                len = GSM_RX_BUFF.gsm_wr;

                SMS_Rx_PDU(GSM_rx, len);
            }
        }
        else					///TEXT模式
        {
            j	= 0;
            q	= 0;
            memset( reg_str, 0, sizeof( reg_str ) );
            for( i = 6; i < len; i++ )
            {
                if( ( j == 1 ) && ( GSM_rx[i] != '"' ) )
                {
                    reg_str[q++] = GSM_rx[i];
                }
                if( GSM_rx[i] == '"' )
                {
                    j++;
                    if(j > 1)
                        break;
                }
            }
            if( RT_EOK == rt_mq_recv( &mq_GSM, (void *)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )   //等待1000ms,实际上就是变长的延时,最长1000ms
            {
                memset( GSM_rx, 0, sizeof( GSM_rx ) );
                memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
                len = GSM_RX_BUFF.gsm_wr;
                SMS_Rx_Text(GSM_rx, reg_str);
            }
        }

    }

#ifdef SMS_TYPE_PDU
    else if( strncmp( (char *)GSM_rx, "+CMGR:", 6 ) == 0 )
    {
        if( RT_EOK == rt_mq_recv( &mq_GSM, (void *)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )   //等待1000ms,实际上就是变长的延时,最长1000ms
        {
            memset( GSM_rx, 0, sizeof( GSM_rx ) );
            memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
            len = GSM_RX_BUFF.gsm_wr;

            SMS_Rx_PDU(GSM_rx, len);
        }
    }
#else
    else if( strncmp( (char *)GSM_rx, "+CMGR:", 6 ) == 0 )
    {
        //+CMGR: "REC UNREAD","8613602069191", ,"13/05/16,13:05:29+35"
        // 获取要返回短息的目的号码
        j	= 0;
        q	= 0;
        memset( reg_str, 0, sizeof( reg_str ) );
        for( i = 6; i < 50; i++ )
        {
            if( ( j == 3 ) && ( GSM_rx[i] != '"' ) )
            {
                reg_str[q++] = GSM_rx[i];
            }
            if( GSM_rx[i] == '"' )
            {
                j++;
            }
        }
        if( RT_EOK == rt_mq_recv( &mq_GSM, (void *)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )   //等待1000ms,实际上就是变长的延时,最长1000ms
        {
            memset( GSM_rx, 0, sizeof( GSM_rx ) );
            memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
            len = GSM_RX_BUFF.gsm_wr;
            SMS_Rx_Text(GSM_rx, reg_str);
        }
    }
#endif

#endif
    if(strncmp((char *)GSM_rx, "%IPSENDX:1", 10) == 0)	 // 链路 1  TCP 发送OK
    {
        //exam:	%IPSENDX:1,15
        //--------消息序号 递增 --------
        JT808Conf_struct.Msg_Float_ID++;
        WatchDog_Feed();
    }
    else if(strncmp((char *)GSM_rx, "%IPCLOSE: 2", 11) == 0) // ISP close
    {
        if(GB19056.workstate == 0)
        {
            rt_kprintf("\r\n");
            rt_kprintf("%s", GSM_rx);
            rt_kprintf("\r\n");
        }
    }
    else if(strncmp((char *)GSM_rx, "IPCLOSE", 5) == 0)
    {
        DataLink_Online = 0;
        ModuleStatus &= ~Status_GPRS;
        // rt_kprintf("\r\nclose  all!\r\n");
        DataDial.Pre_Dial_flag = 1;
    }
    else if((strncmp((char *)GSM_rx, "%IPCLOSE:", 9) == 0) || (strncmp((char *)GSM_rx, "1, CLOSED", 9) == 0)) //1, CLOSED
    {
        DataLink_Online = 0;
        ModuleStatus &= ~Status_GPRS;
        if(GB19056.workstate == 0)
            rt_kprintf("\r\nTCP连接关闭!\r\n");
        if(CallState == CallState_Idle)		 //  不要再通话的时候操作
        {
            rt_hw_gsm_output("ATH\r\n");
            DataLink_EndFlag = 1;
            DEV_Login.Operate_enable = 1; //重新鉴权
        }

