nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/gsm/Device_gsm.c
    }
#ifdef M50_GSM
    if(((DataDial.Dial_step == Dial_DNSR1) || (DataDial.Dial_step == Dial_DNSR2)) && (len > 8))
    {
        /*
        if(sscanf(psrc,"%d.%d.%d.%d",ip[0],ip[1],ip[2],ip[3]) == 4)
        	{
        	memset( pcurr_socket->ip_addr, 0, 15 );
        	memcpy( pcurr_socket->ip_addr, psrc, len );

        	rt_kprintf( "\ndns ip=%s", pcurr_socket->ip_addr );
            }
           */
        i = str2ip((char *)GSM_rx, RemoteIP_Dnsr);
        if (i <= 3)
            failed = true;
        else
        {
            //memcpy((char*)SysConf_struct.IP_Main,RemoteIP_main,4);
            // SysConf_struct.Port_main=RemotePort_main;
            //Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
            DataLink_MainSocket_set(RemoteIP_Dnsr, RemotePort_main, 1);
            dnsrok = true;
            if(GB19056.workstate == 0)
                rt_kprintf("\r\n   域名解析成功:%s\r\n", GSM_rx);

            Dial_Stage(Dial_MainLnk);  //--   切换到拨号
        }
    }
#endif
    if(strncmp((char *)GSM_rx, "%DNSR:", 6) == 0)
    {
        //%DNSR:113.31.28.100
        //%DNSR:0.0.0.0
        if(strncmp((char *)GSM_rx, "%DNSR:0.0.0.0", 13) == 0)
        {
            if((Dial_jump_State == 7) || (Dial_jump_State == 8))
                Dial_jump_State = 0;
            Dnsr_state = 0; //表示DNSR 状态下拨号

        }
        else
        {


            i = str2ip((char *)GSM_rx + 6, RemoteIP_Dnsr);
            if (i <= 3) failed = true;
            //memcpy((char*)SysConf_struct.IP_Main,RemoteIP_main,4);
            // SysConf_struct.Port_main=RemotePort_main;
            //Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
            DataLink_MainSocket_set(RemoteIP_Dnsr, RemotePort_main, 1);
            if(GB19056.workstate == 0)
                rt_kprintf("\r\n   域名解析成功\r\n");

            Dial_Stage(Dial_MainLnk);  //--   切换到拨号
            return ;
        }
    }
    if(strncmp((char *)GSM_rx, "+COPS: 0,0,", 11) == 0)
    {
        // M50    移动卡 +COPS: 0,0,"CHINA MOBILE"
        // M50   联通卡  +COPS: 0,0,"CHINA UNICOM GSM"
        // 联通卡	      +COPS: 0,0,"CHINA UNICOM",0
        //移动卡	     +COPS: 0,0,"CHINA MOBILE",0
        //注销的卡	  +COPS: 0
        if(strncmp((char *)GSM_rx + 12, "CHINA UNICOM", 12) == 0)
        {
          if(strncmp(APN_String, "UNINET", 6))
          {
            memset(APN_String, 0, sizeof(APN_String));
            memcpy(APN_String, "UNINET", 6);
            memset((u8 *)SysConf_struct.APN_str, 0 , sizeof(SysConf_struct.APN_str));
            memcpy(SysConf_struct.APN_str, (u8 *)APN_String, strlen((const char *)APN_String));
            Api_Config_write(config, ID_CONF_SYS, (u8 *)&SysConf_struct, sizeof(SysConf_struct));
          }
		  else
		  	 if((DispContent) && (GB19056.workstate == 0))
            rt_kprintf("  need to update uninet\r\n");   

            //联通的
            memset((char *)Dialinit_APN, 0, sizeof(Dialinit_APN));
            strcat((char *)Dialinit_APN, "AT+CGDCONT=1,\"IP\",\"UNINET\"\r\n");
        }
        else if(strncmp((char *)GSM_rx + 12, "CHINA MOBILE", 12) == 0)
        {
         if(strncmp(APN_String, "CMNET", 5))
          {
            memset(APN_String, 0, sizeof(APN_String));
            memcpy(APN_String, "CMNET", 5);
            memset((u8 *)SysConf_struct.APN_str, 0 , sizeof(SysConf_struct.APN_str));
            memcpy(SysConf_struct.APN_str, (u8 *)APN_String, strlen((const char *)APN_String));
            Api_Config_write(config, ID_CONF_SYS, (u8 *)&SysConf_struct, sizeof(SysConf_struct)); 
          }		
		 else
		 if((DispContent) && (GB19056.workstate == 0))
					rt_kprintf("  need to update cmnet\r\n");	 

            // 移动的
            memset(Dialinit_APN, 0, sizeof(Dialinit_APN));
            strcat(Dialinit_APN, "AT+CGDCONT=1,\"IP\",\"CMNET\"\r\n");
        }
        CommAT.Initial_step++;
        //-------------------------------------------------------------------------


    }
    else if(strncmp((char *)GSM_rx, "+COPS: 0", 8) == 0) //----该卡被注销了
    {
        COPS_Couter++;
        if(COPS_Couter >= 3)
        {
            COPS_Couter = 0;
            CommAT.Initial_step++;
            if(GB19056.workstate == 0)
                rt_kprintf("\r\n  SIM卡搜索不到网络\r\n");
        }
    }
    else if(strncmp((char *)GSM_rx, "OK", 2) == 0)
    {
        ok = true;
        if((DispContent) && (GB19056.workstate == 0))
            rt_kprintf(" OK\r\n");
        //-------------------------------------------
#ifdef REC_VOICE_ENABLE
        VOC_REC_filedel();
#endif
        //   Online  state  OK  ,clear Error Counter
        if(DataLink_Status())
        {
            Online_error_counter = 0; // clear
        }

    }
    else if (strcmp((char *)GSM_rx, "NO DIALTONE") == 0) failed = true;
    else if (strcmp((char *)GSM_rx, "NO ANSWER") == 0) failed = true;
    if (strncmp((char *)GSM_rx, "NO CARRIER", 10) == 0)
    {
        //  NO CARRIER
        CallState = CallState_Idle;
        Speak_OFF;// 关闭功放
        failed = true;
        // rt_kprintf("\r\n Callstate=Idle\r\n");
    }
    if(strcmp((char *)GSM_rx, "BUSY") == 0)
    {
        // ZHinfotype=ZH_01H;//  车台向终端发送振铃指示
        //subtype=0x12;	   //挂断
        CallState = CallState_Idle;
        failed = true;
        // Off_speaker;		// 关闭功放
        //Clip_flag=0;
        //Clip_counter=0;

    }
    else if(strncmp((char *)GSM_rx, "+CSQ:", 5) == 0)	//场强信息
    {
        //+CSQ: 27,99
        if ( GSM_rx[7] == ',' )
        {
            ModuleSQ = GSM_rx[6] - 0x30;
        }
        else if ( GSM_rx[8] == ',' )
        {
            ModuleSQ = ( GSM_rx[6] - 0x30 ) * 10 + GSM_rx[7] - 0x30;

            if ( ModuleSQ == 99 )
            {
                ModuleSQ = 0;
            }
        }
        //--------------------------------------
        //  You must   register on
        if(CommAT.Total_initial == 1)
        {
            if((ModuleSQ > 7) && (CommAT.Initial_step == 16))
            {
                CommAT.Initial_step++;
                if(GB19056.workstate == 0)
                    rt_kprintf("\r\n CSQ check Pass\r\n");
            }
        }

