nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/gsm/Device_gsm.c
    }

    if (strncmp((char *)GSM_rx, "%TSIM", 5) == 0)	 //-----  %TSIM 1 %TSIM 1
    {
        if(GSM_rx[6] == '0')
        {
            IMSIGet.imsi_error_count++;
            if(IMSIGet.imsi_error_count > 10)
            {
                IMSIGet.Get_state = 2;
                IMSIGet.imsi_error_count = 0;
                GSM_PWR.GSM_power_over = 0;;
                IMSIGet.Get_state = 0;
                // EM310_StartFLAG=0;
                rt_kprintf("\r\n没有检测到SIM卡\r\n");
            }
        }
        else if(GSM_rx[6] == '1')
        {
            IMSIGet.Get_state = 1;
            //rt_kprintf("\r\n  检测到SIM卡\r\n");
        }
    }


    if (strncmp((char *)GSM_rx, "89860", 5) == 0)	 //-----  %TSIM 1 %TSIM 1
    {
        // M50
        ok = 0; // 借用做下标
        for(i = 0; i < 10; i++)
        {
            ProductAttribute._5_Sim_ICCID[ok] = ((GSM_rx[2 * i] - 0x30) << 4) + (GSM_rx[1 + 2 * i] - 0x30);
            ok++;
        }
        IMSIGet.Get_state = 1;
        rt_kprintf("\r\n  检测到SIM卡\r\n");
    }
    else if (strncmp((char *)GSM_rx, "460", 3) == 0)	//----- Nathan Add
    {

        CommAT.Total_initial = 1;	// 进行参数配置
        //---  add for Test  -----
        if(GB19056.workstate == 0)
            rt_kprintf("\r\n获取IMSI 号码:%s \r\n", GSM_rx);
        memcpy((char *)IMSI_CODE, (char *)GSM_rx, 15);
        IMSIGet.imsi_error_count = 0;
        IMSIGet.Get_state = 1;
        GSM_PWR.GSM_power_over = 2;   //  get imsi
        IMSIGet.Get_state = 0;
        CommAT.Total_initial = 1;	// 进行参数配置
    }
    if (strncmp((char *)GSM_rx, "+CCID: \"", 8) == 0)
    {
        //+CCID: "89860109520220884603"    AT+CCID
        //  获取终端属性  ，ICCID 字段
        ok = 0; // 借用做下标
        for(i = 0; i < 10; i++)
        {
            ProductAttribute._5_Sim_ICCID[ok] = ((GSM_rx[8 + 2 * i] - 0x30) << 4) + (GSM_rx[9 + 2 * i] - 0x30);
            ok++;
        }
    }
    else if(strncmp((char *)GSM_rx, "RING", 4) == 0) //电话  RING
    {
        if((JT808Conf_struct.Auto_ATA_flag == 1) && (Calling_ATA_flag == 0))
        {

            Ring_counter++;
            if(Ring_counter >= 3)
            {
                Calling_ATA_flag = 1;
                Ring_counter = 0;
            }
        }
    }
    else if ((strlen((char *)GSM_rx) >= 7) && (strncmp((char *)GSM_rx, "CONNECT FAIL", 12) == 0))
    {

        DataLink_EndFlag = 1; //AT_End();

    }
    else if ((strlen((char *)GSM_rx) >= 7) && (strncmp((char *)GSM_rx, "CONNECT", 7) == 0))
    {
        connect = true;
    }

    //1, CONNECT OK
    if ((strncmp((char *)GSM_rx, "1, CONNECT OK", 13) == 0))
    {
        connect = true;
    }
    else if ((strncmp((char *)GSM_rx, "2, CONNECT OK", 13) == 0))
    {
        connect_2 = true;
    }
    if((strncmp((char *)GSM_rx, "ERROR: 13", 9) == 0) || (strncmp((char *)GSM_rx, "ERROR:13", 8) == 0) || (strncmp((char *)GSM_rx, "ERROR:35", 8) == 0)) //ERROR:13
    {
        Online_error_counter++;
        if(Online_error_counter > 3)
        {
            //  rt_kprintf("\r\n  error 13  >3  disc\r\n");
            DataLink_EndFlag = 1; //AT_End();
            Online_error_counter = 0;
        }

    }
    if(strncmp((char *)GSM_rx, "ERROR:13", 8) == 0) //ERROR:13
    {
        Online_error_counter++;
        if(Online_error_counter > 3)
        {
            // rt_kprintf("\r\n  error 13  >3  disc\r\n");
            DataLink_EndFlag = 1; //AT_End();
            Online_error_counter = 0;
        }

    }
    else  //ERROR: 14
        if((strncmp((char *)GSM_rx, "ERROR:30", 9) == 0) || (strncmp((char *)GSM_rx, "ERROR:20", 9) == 0) || (strncmp((char *)GSM_rx, "ERROR:14", 14) == 0) || (strncmp((char *)GSM_rx, "ERROR:19", 14) == 0)\
                || (strncmp((char *)GSM_rx, "ERROR:6", 8) == 0) || (strncmp((char *)GSM_rx, "ERROR:7", 7) == 0) || (strncmp((char *)GSM_rx, "ERROR:8", 8) == 0) || (strncmp((char *)GSM_rx, "ERROR:10", 9) == 0) || (strncmp((char *)GSM_rx, "ERROR:35", 8) == 0))
        {
            if (Dial_jump_State == 7)
            {
#ifdef M50_GSM
                if(Module_Type)
                    rt_hw_gsm_output(M50_CutDataLnk_str2);
                else
#endif
                    rt_hw_gsm_output("AT%IPCLOSE=1\r\n");
                rt_thread_delay(10);
                Dial_Stage(Dial_DNSR1);  // 后边跳跃到ready to  connect aux DNS
                // rt_kprintf("\r\n   DNSR1  解析 成功-->连接失败\r\n");
                Dnsr_state = 0; //表示DNSR 状态下拨号
                //-------------  End  need	process ---------------------------------------
                memset(GSM_rx, 0, sizeof(GSM_rx));
                GSM_rx_Wr = 0;
                return;
            }
            else if(Dial_jump_State == 8)
            {
#ifdef M50_GSM
                if(Module_Type)
                    rt_hw_gsm_output(M50_CutDataLnk_str2);
                else
#endif
                    rt_hw_gsm_output("AT%IPCLOSE=1\r\n");
                rt_thread_delay(10);
                Dial_Stage(Dial_MainLnk);  // ready to  connect mainlink
                // rt_kprintf("\r\n   DNSR2  解析 成功-->连接失败\r\n");
                Dial_jump_State = 0;
                Dnsr_state = 0; //表示DNSR 状态下拨号
                //-------------  End  need	process ---------------------------------------
                memset(GSM_rx, 0, sizeof(GSM_rx));
                GSM_rx_Wr = 0;
                return;
            }
            else if(DataDial.Dial_step == Dial_MainLnk)  //mainlink  to  auxlink
            {
                // GSM_PutStr("AT%IPCLOSE=1\r\n");
                //  AT_Stage(AT_Dial_AuxLnk);//AT_Dial_AuxLnk
                rt_thread_delay(10);
                Dial_Stage(Dial_AuxLnk);//  ready to connect auxlink

                //-----------  Below add by Nathan  ----------------------------
                DataLink_AuxSocket_set(RemoteIP_aux, RemotePort_main, 0);
                //-------------  End  need	process ---------------------------------------
                memset(GSM_rx, 0, sizeof(GSM_rx));
                GSM_rx_Wr = 0;
                return;
            }
            //--------------------------------
            else
            {
                Online_error_counter++;
                if(Online_error_counter > 3)
                {
                    DataLink_EndFlag = 1; //AT_End();
                    Online_error_counter = 0;
                }
            }
        }
        else if (strncmp((char *)GSM_rx, "ERROR", 5) == 0)
        {
            error = true;
            CallState = CallState_Idle;
            //----------------------
            if(TTS_ACK_Error_Process() == true)
            {
                rt_kprintf("\r\n  TTS ack  error \r\n");
                Speak_OFF;
            }
            else if(DataLink_Status())       //   Online  state  Error    , End Link and Redial
            {
                Online_error_counter++;
                if(Online_error_counter > 3)
                {
                    DataLink_EndFlag = 1; //AT_End();
                    Online_error_counter = 0;
                }
                // rt_kprintf("\r\n Online error\r\n");
            }
            if(GB19056.workstate == 0)
                rt_kprintf("\r\n ERROR\r\n");
        }
        else if (strncmp((char *)GSM_rx, "Unknown", 7) == 0)
            error = true;

    //-------------  End  need	process ---------------------------------------
RXOVER:
    memset(GSM_rx, 0, sizeof(GSM_rx));
    GSM_rx_Wr = 0;

