nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/gsm/Device_gsm.c
    //---------------------  Function  Process Below --------------------------
    if ((DataDial.Dial_step != Dial_MainLnk) && failed)
    {
        Dial_Stage(Dial_Idle);
        return;
    }

    switch (DataDial.Dial_step)
    {
    case Dial_DialInit0:
        if (ok)  Dial_Stage(Dial_DialInit1);
        break;
    case Dial_DialInit1   :
        if (ok) Dial_Stage(Dial_DialInit2);
        break;
    case Dial_DialInit2	:
        if (ok)   Dial_Stage(Dial_DialInit3);
        break;
    case Dial_DialInit3	:
        if (ok)   Dial_Stage(Dial_DialInit4);
        break;
    case Dial_DialInit4	:
        if (ok)  Dial_Stage(Dial_DialInit5);
        break;
    case Dial_DialInit5	:
        if (ok)  Dial_Stage(Dial_DialInit6);
        break;
    case Dial_DialInit6	:
        if (ok)
            /*
                                          初始化完成后，选择首次连接的方式
                          */
            if(Vechicle_Info.Link_Frist_Mode == 1)
                Dial_Stage(Dial_MainLnk);
            else
                Dial_Stage(Dial_DNSR1);

        /*
                 #ifdef MULTI_LINK
                       Dial_Stage(Dial_DNSR1);   // 多连接
        #else
              Dial_Stage(Dial_MainLnk);
              #endif
              */
        break;
    case Dial_DNSR1	:
        if (dnsrok)
        {
            //Dial_Stage(Dial_DNSR2);
            rt_kprintf("\r\n DNSR1 SEND over\r\n");
            goto LIANJIE;
        }
        break;
    case Dial_DNSR2	:
        if (dnsrok)
        {
            goto LIANJIE;
        }
        break;
    case Dial_MainLnk		:
    case Dial_AuxLnk	    :
        if (failed || error)
        {
            DataDial.Dial_step_RetryTimer = Dial_Dial_Retry_Time;				// try again in 6 seconds
            break;
        }
        if (connect)
        {
LIANJIE:        //  below  run once  since  online
            if(DataDial.Dial_step == Dial_MainLnk)   //mainlink
                rt_kprintf("\r\n连接成功TCP---\r\n");
            if(DataDial.Dial_step == Dial_AuxLnk)   //auxlink
                rt_kprintf("\r\n Aux 连接成功TCP---\r\n");
            //     1.   登陆成功后相关操作
            // <--  注册状态
            if(1 == JT808Conf_struct.Regsiter_Status)
            {
                DEV_Login.Operate_enable = 1;
                // if(DEV_Login.Sd_counter==0)
                //   DEV_Login.Enable_sd=1;
                DEV_Login.Sd_counter = 0;
                DEV_Login.Enable_sd = 1;
            }
            else
            {
                JT808Conf_struct.Regsiter_Status = 0;
                if(DEV_regist.Sd_counter == 0)
                    DEV_regist.Enable_sd = 1;
            }

            // connect = true;
            //  -----  Data  Dial Related ------
            if((DataDial.Dial_ON) && (DataDial.Dial_step < Max_DIALSTEP))
            {
                Dial_Stage(Dial_Idle);
                DataDial.Dial_step_Retry = 0;
                DataDial.Dial_step_RetryTimer = 0;
            }
            //-----------------------------------
            //   DataDial.Dial_ON=0;
            DataLink_Online = enable;
            DialLink_TimeOut_Clear();

#ifdef	MULTI_LINK
            TCP2_ready_dial = 1;
#endif

            //--------------------------------------------------------------------->
            Dial_Stage(Dial_Idle); //  state  convert
        }
        //------------------------------------------
        break;
    case Dial_ISP:
        if (failed || error)
        {
            DataDial.Dial_step_RetryTimer = Dial_Dial_Retry_Time;
            break;
        }
        if (connect_2)
        {
            Dial_Stage(Dial_Idle); //	In EM310 Mode
            TCP2_Connect = 1;
            TCP2_sdFlag = 1;
            TCP2_ready_dial = 0;
            DataDial.Dial_ON = 0; //
        }
        break;
    default 			:
        Dial_Stage(Dial_Idle);
        DataDial.Dial_step_Retry = 0;
        break;
    }
    //-----------
}

void  IMSIcode_Get(void)
{


    if(GSM_PWR.GSM_power_over == 1)
    {

        IMSIGet.Checkcounter++;
        if(IMSIGet.Checkcounter > 20)   //  15*30=450ms
        {
            IMSIGet.Checkcounter = 0;
            if(IMSIGet.Get_state == 1)
            {

                rt_hw_gsm_output(IMSI_Check_str);    // 查询 IMSI_CODE 号码
                if(GB19056.workstate == 0)
                    rt_kprintf(IMSI_Check_str);
            }
            else
            {
#ifdef M50_GSM
                if(Module_Type)
                {
                    rt_hw_gsm_output(M50_SIM_Check_Str);    // 先检查 SIM 卡的存在
                    if(GB19056.workstate == 0)
                        rt_kprintf(M50_SIM_Check_Str);


                }
                else
#endif
                {
                    rt_hw_gsm_output(SIM_Check_Str);    // 先检查 SIM 卡的存在
                    if(GB19056.workstate == 0)
                        rt_kprintf(SIM_Check_Str);
                }
            }
        }
    }

    if(GSM_PWR.GSM_power_over == 5)
    {
        IMSIGet.Checkcounter++;
        if(IMSIGet.Checkcounter > 20)   //  15*30=450ms
        {
            IMSIGet.Checkcounter = 0;
            rt_hw_gsm_output("ATI\r\n");    // 先检查 SIM 卡的存在
            if(GB19056.workstate == 0)
                rt_kprintf("ATI\r\n");
        }

    }

}

u8   GSM_Working_State(void)  //  表示GSM ，可以正常工作
{
    if((GSM_PWR.GSM_power_over == 1) || (GSM_PWR.GSM_power_over == 2) || (GSM_PWR.GSM_power_over == 5))
        return  GSM_PWR.GSM_power_over;
    else
        return  0;
}



#if 0
void Rx_in(u8 *instr)
{
    u16  inlen = 0;

    if(strncmp(instr, "can1", 4) == 0)
    {
        Get_GSM_HexData("7E8103003B013601300001864F060000010004000001F40000010102000A0000010204000000000000010302000000000110080000000058FFD11700000111080000006458FFD017EA7E", 148, 0);
        OutPrint_HEX("模拟1", GSM_HEX, GSM_HEX_len);

